---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageToCircuit
source: html/d1627fab-fd26-d130-c9b4-e4a9567c170b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageToCircuit Property

Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchVoltageToCircuit { get; }
```